Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
			bytes_read += esp8266_PlusStore_API_file_request( &buffer[0x4000], curPath, 0x8000, (bytes_to_ram - 0x8000));
			if (d->filesize > FIRMWARE_MAX_RAM ){
				bytes_read += esp8266_PlusStore_API_file_request( ((uint8_t*)0x10000000), curPath, FIRMWARE_MAX_RAM, ( d->filesize - FIRMWARE_MAX_RAM) );
			}

#else
			uint32_t bytes_read = 0;
#endif

			if(bytes_read == bytes_to_read ){
				__disable_irq();
				HAL_FLASH_Unlock();
				flash_firmware_update(bytes_read);
			}else{
				menuStatusMessage = download_failed;
			}
			*curPath = 0;
		}
		else if (strstr(curPath, MENU_TEXT_SD_FIRMWARE_UPDATE) == curPath) {
			uint32_t bytes_to_read = d->filesize - 0x4000;
#if USE_SD_CARD
			uint32_t bytes_to_ram = d->filesize > FIRMWARE_MAX_RAM ? FIRMWARE_MAX_RAM : d->filesize;
			uint32_t bytes_read = sd_card_file_request( buffer, MENU_TEXT_SD_CARD_CONTENT"/firmware.bin", 0, 0x4000 );
			bytes_read += sd_card_file_request( &buffer[0x4000], MENU_TEXT_SD_CARD_CONTENT"/firmware.bin", 0x8000, (bytes_to_ram - 0x8000) );
			if (d->filesize > FIRMWARE_MAX_RAM ){
				bytes_read += sd_card_file_request( ((uint8_t*)0x10000000),  MENU_TEXT_SD_CARD_CONTENT"/firmware.bin", FIRMWARE_MAX_RAM, ( d->filesize - FIRMWARE_MAX_RAM) );
			}
#else
			uint32_t bytes_read = 0;
#endif

			if(bytes_read == bytes_to_read ){
				__disable_irq();
				HAL_FLASH_Unlock();
				flash_firmware_update(bytes_read);
			}else{
				menuStatusMessage = download_failed;
			}
			*curPath = 0;
		}
#if USE_SD_CARD
		else if (strstr(curPath, MENU_TEXT_SEARCH_FOR_ROM) == curPath) {
			// Cart with SD and WiFi will search only here (SD) ! -> maybe use "Search SD ROM" ?
			loadStore = false;
			truncate_curPath(); // delete "/Enter"
			make_menu_entry(&dst, "..", Leave_Menu);
			http_request_header[0] = '\0';
			sd_card_find_file( http_request_header, &curPath[sizeof(MENU_TEXT_SEARCH_FOR_ROM)], &dst, &num_menu_entries );
		}
#endif
		else if (strstr(curPath, MENU_TEXT_WIFI_RECONNECT) == curPath){
			loadStore = true;
			*curPath = 0;
		}else{
#if USE_WIFI
			loadStore = true;
#endif
		}

	}

	else {
		set_menu_status_msg(curPath);
		loadStore = true;
	}


	// Test we should load store and if connected to AP
    if(	loadStore || strlen(curPath) == 0 ){
    	int trim_path = 0;
    	if(strlen(curPath) == 0){
#if USE_SD_CARD
    		// check for firmware.bin file in SD root
    		int firmware_file_size = sd_card_file_size("firmware.bin");
    		if(firmware_file_size > 0){
    			// ToDo make_menu_entry_filesize();
    			dst->filesize = (uint32_t)firmware_file_size;
    			strcpy(dst->entryname, MENU_TEXT_SD_FIRMWARE_UPDATE);
        		dst->type = Menu_Action;
        		dst->font = user_settings.font_style;
                dst++;
                num_menu_entries++;
    		}
#endif
    	}

    	if (d->type == Offline_Sub_Menu || strstr(curPath, MENU_TEXT_OFFLINE_ROMS) == curPath) {
    		make_menu_entry(&dst, "..", Leave_Menu);
    		flash_file_list(&curPath[sizeof(MENU_TEXT_OFFLINE_ROMS) - 1], &dst, &num_menu_entries);
    	}

#if USE_SD_CARD
    	else if(d->type == SD_Sub_Menu || strstr(curPath, MENU_TEXT_SD_CARD_CONTENT) == curPath){
    		if(sd_card_file_list(&curPath[sizeof(MENU_TEXT_SD_CARD_CONTENT) - 1], &dst, &num_menu_entries ))
    			qsort((MENU_ENTRY *)&menu_entries[0], num_menu_entries, sizeof(MENU_ENTRY), entry_compare);
    	}
#endif

#if USE_WIFI
    	else if(esp8266_is_connected() == true){
    		*input_field = 0;
    		trim_path = esp8266_file_list(curPath, &dst, &num_menu_entries, plus_store_status, input_field);
    		if(*input_field)
    			menuStatusMessage = STATUS_MESSAGE_STRING;
        }else if(strlen(curPath) == 0){
        	make_menu_entry(&dst, MENU_TEXT_WIFI_RECONNECT, Menu_Action);
    	}
#endif
        if(trim_path){
        	inputActive = 0; // API response trim overrules internal truncate
        	                 // toDo merge trim_path and inputActive ? centralize truncate_curPath() call ?
        	while (trim_path--){
        		truncate_curPath();
        	}
        }

    }

    if(strlen(curPath) == 0){
    	if(menuStatusMessage == STATUS_NONE)
    		menuStatusMessage = STATUS_ROOT;

#if USE_SD_CARD
    	make_menu_entry(&dst, MENU_TEXT_SD_CARD_CONTENT, SD_Sub_Menu);
#if USE_WIFI == 0 // todo check how to sort man menu and how to search
    	make_menu_entry(&dst, MENU_TEXT_SEARCH_FOR_ROM, Input_Field);
#endif
#endif
    	if(	flash_has_downloaded_roms() )
    		make_menu_entry(&dst, MENU_TEXT_OFFLINE_ROMS, Offline_Sub_Menu);

    	make_menu_entry(&dst, MENU_TEXT_SETUP, Setup_Menu);
	}

    if(num_menu_entries == 0){
		make_menu_entry(&dst, "..", Leave_Menu);
    }

    return menuStatusMessage;
}


CART_TYPE identify_cartridge( MENU_ENTRY *d )
{

	CART_TYPE cart_type = { base_type_None, false, false, false, false };

	strcat(curPath, "/");
	append_entry_to_path(d);

	// Test if connected to AP
    if(d->type == Cart_File ){
#if USE_WIFI
    	if(esp8266_is_connected() == false)
#endif
    		return cart_type;
    }
    if(d->type == SD_Cart_File ){
#if ! USE_SD_CARD
   		return cart_type;
#endif
    }

    // select type by file extension?
	char *ext = get_filename_ext(d->entryname);
	const EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (strcasecmp(ext, p->ext) == 0) {
			cart_type.base_type = p->cart_type.base_type;
			cart_type.withSuperChip = p->cart_type.withSuperChip;
			cart_type.uses_ccmram = p->cart_type.uses_ccmram;
			cart_type.uses_systick = p->cart_type.uses_systick;
			break;
		}
		p++;
	}

	// Supercharger cartridges get special treatment, since we don't load the entire
	// file into the buffer here
	if (cart_type.base_type == base_type_None && ( (d->filesize % 8448) == 0 || d->filesize == 6144))
		cart_type.base_type = base_type_AR;
	if (cart_type.base_type == base_type_AR){
		goto close;
	}


	uint32_t bytes_read, bytes_to_read = d->filesize > (BUFFER_SIZE * 1024)?(BUFFER_SIZE * 1024):d->filesize;
	uint8_t tail[16], bytes_read_tail=0;
	if(d->type == Cart_File ){
#if USE_WIFI
		bytes_read = esp8266_PlusStore_API_file_request( buffer, curPath, 0, bytes_to_read );
#endif
	}else if(d->type == SD_Cart_File ){
#if USE_SD_CARD
		bytes_read = sd_card_file_request(buffer, curPath, 0, bytes_to_read);
#endif
	}else{
		bytes_read = flash_file_request( buffer, d->flash_base_address, 0, bytes_to_read );
	}

	if( bytes_read != bytes_to_read ){
		cart_type.base_type = base_type_Load_Failed;
		goto close;
	}
	if(d->filesize >  (BUFFER_SIZE * 1024)){
		cart_type.uses_ccmram = true;
		if(d->type == Cart_File ){
#if USE_WIFI
			bytes_read_tail = (uint8_t)esp8266_PlusStore_API_file_request( tail, curPath, (d->filesize - 16), 16 );
#endif
		}else if(d->type == SD_Cart_File ){
#if USE_SD_CARD
			bytes_read_tail = (uint8_t)sd_card_file_request( tail, curPath, (d->filesize - 16), 16 );
#endif
		}else{
			bytes_read_tail = (uint8_t)flash_file_request( tail, d->flash_base_address, (d->filesize - 16), 16 );
		}
		if( bytes_read_tail != 16 ){
			cart_type.base_type = base_type_Load_Failed;
			goto close;
		}
	}else{
		cart_type.withPlusFunctions = isProbablyPLS(d->filesize, buffer);
		cart_type.withSuperChip =  isProbablySC(d->filesize, buffer);
	}

	// disconnect here or if cart_type != CART_TYPE_NONE
	if (cart_type.base_type != base_type_None) goto close;

	// If we don't already know the type (from the file extension), then we
	// auto-detect the cart type - largely follows code in Stella's CartDetector.cpp

	// Check with types that have headers first since they are more reliable than huristics
	if(isElf(bytes_read, buffer))
	{
		cart_type.base_type = base_type_ELF;
	}
	else if(is_ace_cartridge(bytes_read, buffer)){
		cart_type.base_type = base_type_ACE;
	}
	else if (d->filesize <= 64 * 1024 && (d->filesize % 1024) == 0 && isProbably3EPlus(d->filesize, buffer))
	{
		cart_type.base_type = base_type_3EPlus;
	}
	else if (d->filesize == 2*1024)
	{
		if (isProbablyCV(d->filesize, buffer))
			cart_type.base_type = base_type_CV;
		else
			cart_type.base_type = base_type_2K;
	}
	else if (d->filesize == 4*1024)
	{
		cart_type.base_type = base_type_4K;
	}
	else if (d->filesize == 8*1024)
	{
		// First check for *potential* F8
		int f8 = isPotentialF8(d->filesize, buffer);

		if (memcmp(buffer, buffer + 4096, 4096) == 0)
			cart_type.base_type = base_type_4K;
		else if (isProbablyE0(d->filesize, buffer))
			cart_type.base_type = base_type_E0;
		else if (isProbably3E(d->filesize, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(d->filesize, buffer))
			cart_type.base_type = base_type_3F;
		else if (isProbablyUA(d->filesize, buffer))
			cart_type.base_type = base_type_UA;
		else if (isProbablyFE(d->filesize, buffer) && !f8)
			cart_type.base_type = base_type_FE;
		else if (isProbably0840(d->filesize, buffer))
			cart_type.base_type = base_type_0840;
		else if (isProbablyE78K(d->filesize, buffer)) {
			cart_type.base_type = base_type_E7;
			memmove(buffer+0x2000,buffer,0x2000);
			d->filesize = 16*1024;
		} else
			cart_type.base_type = base_type_F8;
	}
	else if (d->filesize == 8*1024 + 3) {
		cart_type.base_type = base_type_PP;
	}
	else if(d->filesize >= 10240 && d->filesize <= 10496)
	{  // ~10K - Pitfall II
		cart_type.uses_ccmram = true;
		cart_type.uses_systick = true;
		cart_type.base_type = base_type_DPC;
	}
	else if (d->filesize == 12*1024)
	{
		if (isProbablyE7(d->filesize, buffer)){
			cart_type.base_type = base_type_E7;
			memmove(buffer+0x1000, buffer, 0x3000);
			d->filesize = 16*1024;
		} else
			cart_type.base_type = base_type_FA;
	}
	else if (d->filesize == 16*1024)
	{
		if (isProbablyE7(d->filesize, buffer))
			cart_type.base_type = base_type_E7;
		else if (isProbably3E(d->filesize, buffer))
			cart_type.base_type = base_type_3E;
		else
			cart_type.base_type = base_type_F6;
	}
	else if (d->filesize == 29*1024)
	{
		if (isProbablyDPCplus(d->filesize, buffer))
			cart_type.base_type = base_type_DPCplus;
	}
	else if (d->filesize == 32*1024)
	{
		if (isProbably3E(d->filesize, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(d->filesize, buffer))
			cart_type.base_type = base_type_3F;
		else if (isProbablyDPCplus(d->filesize, buffer)){
			cart_type.base_type = base_type_DPCplus;
			cart_type.uses_systick = true;
		}
		else
			cart_type.base_type = base_type_F4;
	}
	else if (d->filesize == 64*1024)
	{
		if (isProbably3E(d->filesize, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(d->filesize, buffer))
			cart_type.base_type = base_type_3F;
		else if (isProbablyEF(d->filesize, buffer))
			cart_type.base_type = base_type_EF;
		else
			cart_type.base_type = base_type_F0;
	}
	else if (d->filesize == 128 * 1024) {
		if (isProbablyDF(tail))
			cart_type.base_type = base_type_DF;
		else if (isProbablyDFSC(tail)){
			cart_type.base_type = base_type_DFSC;
			cart_type.withSuperChip = 1;
		}else
			cart_type.base_type = base_type_SB;
	}
	else if (d->filesize == 256 * 1024)
	{
		if (isProbablyBF(tail))
			cart_type.base_type = base_type_BF;
		else if (isProbablyBFSC(tail)){
			cart_type.base_type = base_type_BFSC;
			cart_type.withSuperChip = 1;
		}else
			cart_type.base_type = base_type_SB;
	}

	close:

